// Структурный паттерн
// позволяет какой-то объект с одним интерфейсом подстроить под другой интерфейс
//---------------------------------------------------------------------------
//        | Шаблон      | Что делает с интерфейсом | Что делает с функциональностью |
//        ---------------------------------------------------------------------------
//        | Декоратор   | Не изменяет/расширяет    | Расширяет                      |
//        ---------------------------------------------------------------------------
//        | Адаптер     | Изменяет                 | Не изменяет                    |
//        ---------------------------------------------------------------------------

package Adapter;

public class AdapterJavaToDatabase extends JavaApplication implements Database{

    @Override
    public void instert() {
        saveObject();
    }

    @Override
    public void update() {
        updateObject();
    }

    @Override
    public void select() {
        loadObject();
    }

    @Override
    public void remove() {
        deleteObject();
    }
}
